{
    "experience": [
        {
            "title" : "Research Associate at Ontario Tech University",
            "descriptions": ["• Coordinated experiments to assess an LLM integrated with a gaze-driven model for enhancing technical video understanding.", "• Reviewed critical recorded data to ensure accuracy, and reliability while providing value-add feedback for subsequent analysis.", "• Managed participant scheduling and logistics to enable seamless, high-quality data collection."],
            "timeline": "June 2024 - August 2024"
        },

        {
            "title" : "Research Assistant at Ontario Tech University",
            "descriptions": ["• Developed a mobile augmented reality data visualization application for iPhone and iPad using Swift and XCode, enabling a guided data exploration experience.", "• Collaborated with team of researchers to define objectives and implemented features within deadlines, ensuring effective communication and timely delivery."],
            "timeline": "May 2021 - August 2021"
        },
     
        {
            "title" : "Teaching Assistant at Ontario Tech University",
            "descriptions": ["• Instructed courses on Web Development, Software Quality Assurance, Mobile App Development, while teaching practical skills.", "• Developed lab programs that increased participant comprehension, boosting performance by ~20% across 4 classes.", "• Conducted code reviews and one-on-one sessions to help students refine problem-solving and coding practices.", "• Resolved technical issues for 100+ learners, ensuring smooth learning through debugging and support."],
            "timeline": "September 2021 - December 2022"
        },
        {
            "title" : "IT Deskside Support at Toronto Hydro",
            "descriptions": ["• Consulted clients and translated complex technical issues into clear solutions to provide client support, resolving tickets.", "• Recommended efficient, cost-effective hardware stock levels by analyzing inventory and building requirements.", "• Troubleshooted computer systems and provided tech support to ensure prompt issue resolution and minimize downtime.", "• Collaborated with IT teams to leverage collective expertise in accurately diagnosing and resolving client-facing issues.", "• Surpassed KPIs for response time with clear communication on ticket progress, ensuring responses within 1-2 hours."],
            "timeline": "September 2019 - August 2020"
        },
        {
            "title" : "Waiter at Swiss Chalet",
            "descriptions" : ["• Ensured customer satisfaction by delivering attentive hospitality and promptly delivering food, beverages and desserts and addressed customer concerns with thoughtful solutions, ensuring an enjoyable dining experience.", "• Collaborated with with coworker to provide timely assistance while thriving in high-pressure environments during peak hours, managed multiple tasks and maintained compsure.", "• Asssisted with opening and closing tasks, including cleaning and organizing the restaurant."],
            "timeline": "July 2018- February 2020"
        }
    ]
}
