{
    "experience": [
        {
            "title" : "Research Associate",
            "descriptions": ["Managed data-gathering experiments, directed planning and execution of experiments to ensure accuracy and efficiency.", "Provided clear instructions and requirements to participants, ensuring smooth operation of experiments.", "Coordinated scheduling and maintained clear, effective ongoing communication to streamline workflow."],
            "timeline": "June 2024 - August 2024"
        },

        {
            "title" : "Research Assistant",
            "descriptions": ["Developed a mobile augmented reality data visualization application for iPhone and iPad using Swift and XCode, enabling a guided data exploration experience.", "Collaborated with team of researchers to define objectives and implemented features within deadlines, ensuring effective communication and timely delivery."],
            "timeline": "May 2021 - August 2021"
        },
     
        {
            "title" : "Teaching Assistant",
            "descriptions" : ["Developed and presented code and demos for multiple lab sessions, taught classes of 20-30 students in programming and software development concepts. Provided on-call support to minimize student wait times for queries.", "Evaluated midterms, assignments and weekly lab tasks, ensuring timely return of grades and offering constructive feedback to help students improve.", "Assisted in courses including Programming Workshop (introductory C++ course), Web Application Development, Software Quality Assurance and Mobile Devices (Mobile application Development)"],
            "timeline": "September 2021 - December 2022"
        },
        {
            "title" : "IT Deskside Support",
            "descriptions" : ["Assisted clients with tech support in company building, communicated in person, phone call and email. Ensured client systems kept running and continuously through maintenance and responsive technical assistance in a customer support role.", "Collaborated with multiple departments to troubleshoot and resolve complex technical challenges, such as diagnosing and repairing a damaged wire impacting elevator screen updates due to construction.", "Managed and optimized electronic hardware inventory to minimize wait times for clients to ensure productivity."],
            "timeline": "September 2019 - August 2020"
        }
    ]
}
